// let quastions = [
//     {
//         "title":"Умумий соғлигингиз ҳолатини қандай бахолайсиз? ",
//         "options":[
//             {type: "single", title: "Аъло даражада", score: 1, id: 1} ,{type: "single", title: "Жуда яхши", score: 2, id: 2},
//         {type: "single", title: "Яхши", score: 3, id: 3}, {type: "single", title: "Коникарли", score: 4, id: 4},   {type: "single",title: "Ёмон" , score: 5, id: 5}],
//         id: 1,
//         subOption:null
//     },
//     {
//         "title":"Хозирги ҳолатингизни 4 ой олдинги ҳолат билан солиштирганда қандай баҳолайсиз? ",
//         "options":[
//             {type: "single", title: "Аввалгидан анча яхши", score: 1, id: 1} ,{type: "single", title: "Аввалгидан бироз яхши", score: 2, id: 2},
//             {type: "single", title: "Деярли аввалгидек", score: 3, id: 3}, {type: "single", title: "Аввалгидан ёмонрок", score: 4, id: 4},   {title: "Аввалгидан жуда ёмон" , score: 5, id: 5 },
//         ],
//         id: 2,
//         subOption:null
//     },
//     {
//           "title":"Кейинги саволлар сизнинг одатий кунингизда дуч келадиган жисмоний юкламалар билан боғлиқ. Хозирги вақтда сизнинг соғлиғингиз ҳолати қуйида келтирилган жисмоний юкламаларни бажаришда қийинчилик туғдирадими (чегараланганми)? Агар шундай бўлса қай даражада намоён бўлади? " ,
//           "options":[  {type: "single", title:  "Ха, яққол чегараланган", score: 1, id: 1, subOption:null} ,{type: "single", title: "Ха бироз чегараланган", score: 2, id: 2, subOption:null},{type: "single", title: "Йўк, умуман чегараланмаган", score: 3, id: 3 }], subOption:null,
//           id: 3,
//           subOption:null
//     },
//     {
//         "title":"Охирги 4 ҳафта ичида жисмоний (соғлиғингиз) ва эмоционал ҳолатингиз (кайфиятингиз) сизга оила аъзоларингиз, дўстларингиз, қўшниларингиз ва (ёки) хамкасабаларингиз билан бирга вақт ўтказишингизга қанчалик тўсқинлик қилди? " ,
//         "options":[  {type: "single", title:  "Мутлақо (тўсқинлик қилмади)", score: 1, id: 1} ,{type: "single", title: "Бироз", score: 2, id: 2},{type: "single", title: "Ўртача", score: 3, id: 3},{type: "single", title:  "Сезиларли", score: 4, id: 4},{type: "single", title:  "Жуда", score: 5, id: 5, }], 
//         subOption:null,
//         id: 4
//     },
//     {
//         "title":"Охирги 4 ҳафта ичида қанчалар кучли жисмоний оғриқ ҳис қилдингиз? " ,
//         "options":[  {type: "single", title:  "Мутлақо сезмадим", score: 1, id: 1} ,{title: "Жуда оз", score: 2, id: 2},{title: "Оз даражада", score: 3, id: 3},{title:  "Ўртача", score: 4, id: 4},{title:  "Кучли", score: 5, id: 5},{title:  "Жуда кучли", score: 6, id: 6}],
//         id: 5,
//         subOption:null
//     },
//     {
//         "title":"Охирги 4 ҳафта ичида сизни безовта қилган оғрик қай даражада одатий ишингизни бажаришга халақит берди (уй ва уйдан ташкарида)? " ,
//         "options":[  {type: "single", title:  "Мутлақо", score: 1, id: 1} ,{type: "single", title: "Бироз", score: 2, id: 2},{type: "single", title: "Уртача", score: 3, id: 3},{type: "single", title:  "Кучли", score: 4, id: 4},{type: "single", title:  "Жуда кучли", score: 5, id: 5}],
//         id: 6,
//         subOption:null
//     },
//     {
//         "title":"Охирги 4 ҳафта давомидасизни жисмоний ва эмоционал ҳолатингиз одамлар билан (дўстларингиз ва қариндошларингиз ва х.к ) фаол мулоқотда бўлишга қанчалик ҳалақит берди? " ,
//         "options":[  {type: "single", title:  "Ҳар доим", score: 1, id: 1} ,{type: "single", title: "Купинча", score: 2, id: 2},{type: "single", title: "Баъзида", score: 3, id: 3},{type: "single", title:  "Кам ҳолатда", score: 4, id: 4, },{type: "single", title:  "Ҳеч қачон", score: 5, id: 5}],
//         id: 7,
//         subOption:null
//     },
    
//     {
//         "title":"Кейинги саволлар сизнинг одатий кунингизда дуч келадиган жисмоний юкламалар билан боғлиқ. Хозирги вақтда сизнинг соғлиғингиз ҳолати қуйида келтирилган жисмоний юкламаларни бажаришда қийинчилик туғдирадими (чегараланганми)? Агар шундай бўлса қай даражада намоён бўлади? " ,
//         "options":[  {type: "triple", title:  "Ха, яққол чегараланган", score: 1, id: 1, } ,{type: "triple", title: "Ха бироз чегараланган", score: 2, id: 2},{type: "triple", title: "Йўк, умуман чегараланмаган.", score: 3, id: 3, }],
//         id: 8,
//         subOption:["Югуриш, оғир юк кўтариш, спортнинг куч сарф этувчи турлари билан шуғулланиш каби оғир жисмоний юкламалар",
//         "Столни суриш, чангюткич билан ишлаш, мева ва резаворларни териш каби ўртача жисмоний юкламалар",
//         "Махсулотлар солинган сумкани кўтариш ёки кўтариб юриш",
//         "Бир қанча зинапоядан пиёда кўтарилиш",
//         "Битта зинапоядан пиёда кўтарилиш",
//         "Олдинга энгашиш, тиззада туриш, чўккалаб ўтириш",
//         "Бир километрдан ортиқ масофага юриш",
//         "200 метрдан ортиқ масофага юриш",
//         "100 метр масофага юриш",
//         "Мустақил равишда ювиниш ва кийиниш"
    
    
//     ]
//     },

//     {
//         "title":"Охирги 4 ҳафта ичида кундалик юмушларни бажаришда қийинчилик туғилдими, нима сабабдан?" ,
//         "options":[  {type: "double", title:  "Ха", score: 1, id: 1, } ,{type: "double", title: "Йуқ", score: 2, id: 2}],
//         id: 9,
//         subOption:["Мўлжалингиздан кўра камроқ иш бажардингиз",
//         "Меҳнат фаолияти ёки бошқа юмушларни бажариш вақтини қисқартиришга тўғри келди",
//         "Сиз муайян иш турини ёки бошқа бир фаолиятни бажаришга чекландингиз",
//         "Ўз ишингизни ёки бошқа юмушларни бажаришда қийинчиликка дуч келдингиз (масалан қўшимча уруниш талаб этади)",
       
//     ]
//     },


//     {
//         "title":"Охирги 4 ҳафта ичида эмоционал ҳолатингиз (кайфиятингиз) ўз ишингиз ёки бошқа кундалик юмушларни бажаришда қийинчилик туғдирдими, нима сабабдан?" ,
//         "options":[  {type: "double", title:  "Ха", score: 1, id: 1, } ,{type: "double", title: "Йуқ", score: 2, id: 2}],
//         id: 11,
//         subOption:["  Меҳнат фаолияти ёки бошқа юмушларни бажариш вақтини қисқартиришга тўғри келди",
//         "Мўлжалингиздан кўра камроқ иш бажардингиз",
//         "Ўз ишингизни ёки бошқа юмушларни одатий тартибда бажара олмадингиз" ]
//     },

//    {
//         "title":"Кейинги савол сиз ўзингизни охирги 4 хафта ичида қандай ҳис қилганлигингиз ва кайфиятингиз қандай бўлганлиги тўғрисида. Илтимос қуйидаги саволларга жавоб беришда ҳиссиётингизга энг мос келадиган битта жавобни танланг. " ,
//         "options":[  {type: "sixtuple", title:  "Хар доим", score: 1, id: 1, } ,{type: "sixtuple", title: "Купинча", score: 2, id: 2}, {type: "sixtuple", title:  "Тез-тез", score: 3, id: 3, }, {type: "sixtuple", title:  "Баъзида", score: 4, id: 4, },{type: "sixtuple", title:  "Кам холларда", score: 5, id: 5, },{type: "sixtuple", title:  "Хеч қачон", score: 6, id: 6, },],
//         id: 10,
//         subOption:[" Ўзингизни тетик сездингиз",
//         "Ўзингизни куч-қувватга тўла ҳис эттингиз",
//         "Ўзингизни тинч ва хотиржам ҳис эттингиз",
//         "Ўзингизни бахтли ҳис қилдингиз",
//         "Сиз кучли асабийлашдингиз",
//         "Ўзингизни шундай тушкун ҳис қилдингизки ҳеч нарса сизни тетиклаштира олмасди",
//         "Ўзингизни руҳан тушкун ва қайғули ҳолатда ҳис этдингиз.",
//         "Ўзингизни эзилгандек ҳис эттингиз",
//         "Ўзингизда чарчаш ҳолатини сездингиз"

//     ]
//     },


//     {
//         "title":"Қуйида келтирилган жумлалардан қайсилари сизга нисбатан мос келади ёки келмайди." ,
//         "options":[  {type: "quintuple", title:  "Худди шундай", score: 1, id: 1, } ,{type: "quintuple", title: "Деярли шундай", score: 2, id: 2}, {type: "quintuple", title:  "Билмайман", score: 3, id: 3, }, {type: "quintuple", title:  "Менимча ундай эмас", score: 4, id: 4, },{type: "quintuple", title:  "Ундай эмас", score: 5, id: 5, },],
//         id: 10,
//         subOption:[" Мен бошқаларга нисбатан касалликка мойилроқман деб ўйлайман",
//         "Мен соғлиғим ёмонлашади деган ҳавотирдаман",
//         "Мени соғлиғим кўпчилик танишларимникидан ёмон эмас.",
//         "Мени соғлиғим аъло даражада",
        
//     ]
//     },
 
// ]

export const questions = [
    {
        id: 1,
        title:"Умумий соғлигингиз ҳолатини қандай бахолайсиз? ",
        options: {
            type: 'single/multiple',
            optionsList: [
                {
                    title: "Аъло даражада", 
                    score: 1, 
                    id: 1,
                    subOptions: {
                        subOptionTitles:[
                            {
                                order: 1,
                                text: 'Test text'
                            },
                            {
                                order: 2,
                                text: 'Test text'
                            },
                            {
                                order: 3,
                                text: 'Test text'
                            },
                            {
                                order: 4,
                                text: 'Test text'
                            },
                        ], 
                        subOptionsList: [
                            {
                                id: 1,
                                score: 1
                            },
                            {
                                id: 2,
                                score: 2
                            },
                            {
                                id: 3,
                                score: 3
                            },
                            {
                                id: 4,
                                score: 4
                            },
                        ]
                    }
                }
            ]
        },
    },
]


// const test = {
//     id: 1,
//     title:"Умумий соғлигингиз ҳолатини қандай бахолайсиз? ",
//     options: {
//         type: 'single/multiple',
//         optionsList: [
//             {
//                 title: "Аъло даражада", 
//                 score: 1, 
//                 id: 1,
//                 subOptions: {
//                     subOptionTitles:[
//                         {
//                             order: 1,
//                             text: 'Test text'
//                         },
//                         {
//                             order: 2,
//                             text: 'Test text'
//                         },
//                         {
//                             order: 3,
//                             text: 'Test text'
//                         },
//                         {
//                             order: 4,
//                             text: 'Test text'
//                         },
//                     ], 
//                     subOptionsList: [
//                         {
//                             id: 1,
//                             score: 1
//                         },
//                         {
//                             id: 2,
//                             score: 2
//                         },
//                         {
//                             id: 3,
//                             score: 3
//                         },
//                         {
//                             id: 4,
//                             score: 4
//                         },
//                     ]
//                 }
//             }
//         ]
//     },
// },